In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("data/titanic.csv")
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
data.drop(columns=["Cabin","PassengerId","SibSp","Parch","Ticket","Fare","Embarked"], inplace=True)

In [7]:
data.head()

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0

In [9]:
data.columns.tolist()

['Survived', 'Pclass', 'Name', 'Sex', 'Age']

In [10]:
cols = ["Name","Pclass","Age","Sex","Survived"]
data = data[cols]
data.head()

,Name,Pclass,Age,Sex,Survived
0,"Braund, Mr. Owen Harris",3,22.0,male,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,female,1
2,"Heikkinen, Miss. Laina",3,26.0,female,1
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,female,1
4,"Allen, Mr. William Henry",3,35.0,male,0

In [12]:
data.tail(7)

                                         Name  Pclass   Age     Sex  Survived
884                    Sutehall, Mr. Henry Jr       3  25.0    male         0
885      Rice, Mrs. William (Margaret Norton)       3  39.0  female         0
886                     Montvila, Rev. Juozas       2  27.0    male         0
887              Graham, Miss. Margaret Edith       1  19.0  female         1
888  Johnston, Miss. Catherine Helen "Carrie"       3   NaN  female         0
889                     Behr, Mr. Karl Howell       1  26.0    male         1
890                       Dooley, Mr. Patrick       3  32.0    male         0

In [14]:
data.shape

(891, 5)

In [16]:
data.iloc[0]

Name        Braund, Mr. Owen Harris
Pclass                            3
Age                            22.0
Sex                            male
Survived                          0
Name: 0, dtype: object

In [17]:
data.iloc[0:3]

,Name,Pclass,Age,Sex,Survived
0,"Braund, Mr. Owen Harris",3,22.0,male,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,female,1
2,"Heikkinen, Miss. Laina",3,26.0,female,1

In [18]:
data.iloc[0:3, 0:2]  # data.iloc[0:3][0:2] not working

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3

In [20]:
data.iloc[0:3][0:2]

,Name,Pclass,Age,Sex,Survived
0,"Braund, Mr. Owen Harris",3,22.0,male,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,female,1

In [21]:
data.iloc[-3:]

                                         Name  Pclass   Age     Sex  Survived
888  Johnston, Miss. Catherine Helen "Carrie"       3   NaN  female         0
889                     Behr, Mr. Karl Howell       1  26.0    male         1
890                       Dooley, Mr. Patrick       3  32.0    male         0

In [32]:
data.iloc[0:2]["Name"]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
Name: Name, dtype: object

In [35]:
data["Sex"] == "female"

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

In [41]:
data[data["Sex"] == "female"]

,Name,Pclass,Age,Sex,Survived
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,female,2
2,"Heikkinen, Miss. Laina",3,26.0,female,2
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,female,2
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,27.0,female,2
9,"Nasser, Mrs. Nicholas (Adele Achem)",2,14.0,female,2
...,...,...,...,...,...
880,"Shelley, Mrs. William (Imanita Parrish Hall)",2,25.0,female,2
882,"Dahlberg, Miss. Gerda Ulrika",3,22.0,female,2
885,"Rice, Mrs. William (Margaret Norton)",3,39.0,female,2
887,"Graham, Miss. Margaret Edith",1,19.0,female,2
888,"Johnston, Miss. Catherine Helen ""Carrie""",3,NaN,female,2

In [43]:
data["Sex"].replace("female","F",inplace=True)
# data["Sex"] = data["Sex"].replace("female","F")
data.head()

,Name,Pclass,Age,Sex,Survived
0,"Braund, Mr. Owen Harris",3,22.0,male,2
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,F,2
2,"Heikkinen, Miss. Laina",3,26.0,F,2
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,F,2
4,"Allen, Mr. William Henry",3,35.0,male,2

In [44]:
data["Sex"] = data["Sex"].replace(["female","male"],["F","M"])
data.head()

,Name,Pclass,Age,Sex,Survived
0,"Braund, Mr. Owen Harris",3,22.0,M,2
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,F,2
2,"Heikkinen, Miss. Laina",3,26.0,F,2
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,F,2
4,"Allen, Mr. William Henry",3,35.0,M,2

In [46]:
data.rename(columns = {"Pclass":"PassengerClass", "Sex":"Gender"},inplace=True)
data.head()

,Name,PassengerClass,Age,Gender,Survived
0,"Braund, Mr. Owen Harris",3,22.0,M,2
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,F,2
2,"Heikkinen, Miss. Laina",3,26.0,F,2
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,F,2
4,"Allen, Mr. William Henry",3,35.0,M,2

In [48]:
# data.rename?

In [49]:
data["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [50]:
data["Age"].min()

0.42

In [51]:
data["Age"].max()

80.0

In [52]:
data["Age"].count() # realized null values

714

In [55]:
data["Age"].isnull().sum()

177

In [56]:
data["Age"].sum()

21205.17

In [57]:
data["Gender"].unique()

array(['M', 'F'], dtype=object)

In [58]:
data["Gender"].value_counts()

M    577
F    314
Name: Gender, dtype: int64

In [59]:
data.isnull()

      Name  PassengerClass    Age  Gender  Survived
0    False           False  False   False     False
1    False           False  False   False     False
2    False           False  False   False     False
3    False           False  False   False     False
4    False           False  False   False     False
..     ...             ...    ...     ...       ...
886  False           False  False   False     False
887  False           False  False   False     False
888  False           False   True   False     False
889  False           False  False   False     False
890  False           False  False   False     False

[891 rows x 5 columns]

In [60]:
data.isnull().sum() # sum true values

Name                0
PassengerClass      0
Age               177
Gender              0
Survived            0
dtype: int64